In [1]:
import pandas as pd
import numpy as np

In [3]:
"""Nombre,V1,V2,V3,V4
Jose,3984,3612,376,1688
Pedro,1442,1390,4215,2591
Maria,525,2393,2974,2088
Juan,599,1492,405,2815
Sebastian,1792,1584,768,3477
Noe,3711,3732,342,4128
Francisco,3151,4213,3588,4874
Tomas,4873,2295,3704,4340
Alejandro,4400,2558,3568,4915
"""
data = {
    'Nombre' : ['Jose', 'Pedro', 'Maria', 'Juan', 'Sebastian', 'Noe', 
                'Framcisco', 'Tomas', 'Alejandro'],
    'V1' : [3948, 1442, 525, 599, 1792, 3711, 3451, 4873, 4400],
    'V2' : [3612, 1390, 2393, 1492, 1792, 3732, 3151, 2295, 4400],
    'V3' : [376, 4215, 2974, 405, 1584, 342, 4213, 3704, 3568],
    'V4' : [1688, 2591, 2088, 2815, 3477, 4128, 4874, 4340, 4915]    
}

df = pd.DataFrame(data)
print(df)

      Nombre    V1    V2    V3    V4
0       Jose  3948  3612   376  1688
1      Pedro  1442  1390  4215  2591
2      Maria   525  2393  2974  2088
3       Juan   599  1492   405  2815
4  Sebastian  1792  1792  1584  3477
5        Noe  3711  3732   342  4128
6  Framcisco  3451  3151  4213  4874
7      Tomas  4873  2295  3704  4340
8  Alejandro  4400  4400  3568  4915

In [5]:
df.info

<bound method DataFrame.info of       Nombre    V1    V2    V3    V4
0       Jose  3948  3612   376  1688
1      Pedro  1442  1390  4215  2591
2      Maria   525  2393  2974  2088
3       Juan   599  1492   405  2815
4  Sebastian  1792  1792  1584  3477
5        Noe  3711  3732   342  4128
6  Framcisco  3451  3151  4213  4874
7      Tomas  4873  2295  3704  4340
8  Alejandro  4400  4400  3568  4915>

In [7]:
df.describe

<bound method NDFrame.describe of       Nombre    V1    V2    V3    V4
0       Jose  3948  3612   376  1688
1      Pedro  1442  1390  4215  2591
2      Maria   525  2393  2974  2088
3       Juan   599  1492   405  2815
4  Sebastian  1792  1792  1584  3477
5        Noe  3711  3732   342  4128
6  Framcisco  3451  3151  4213  4874
7      Tomas  4873  2295  3704  4340
8  Alejandro  4400  4400  3568  4915>

In [14]:
df.tail(10)

      Nombre    V1    V2    V3    V4
0       Jose  3948  3612   376  1688
1      Pedro  1442  1390  4215  2591
2      Maria   525  2393  2974  2088
3       Juan   599  1492   405  2815
4  Sebastian  1792  1792  1584  3477
5        Noe  3711  3732   342  4128
6  Framcisco  3451  3151  4213  4874
7      Tomas  4873  2295  3704  4340
8  Alejandro  4400  4400  3568  4915

In [11]:
print(df.Nombre.apply(str.upper))

0         JOSE
1        PEDRO
2        MARIA
3         JUAN
4    SEBASTIAN
5          NOE
6    FRAMCISCO
7        TOMAS
8    ALEJANDRO
Name: Nombre, dtype: object

## Convierte los nombrea a mayusculas